STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/app_ble.c
                case ACI_GAP_BOND_LOST_VSEVT_CODE:    
          APP_DBG_MSG("==>> ACI_GAP_BOND_LOST_VSEVT_CODE \n");
          ret = aci_gap_allow_rebond(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_allow_rebond : Fail, reason: 0x%x\n", ret);
          } 
          else 
          {
            APP_DBG_MSG("==>> aci_gap_allow_rebond : Success \n");
          }
          break; /* ACI_GAP_BOND_LOST_VSEVT_CODE */

        case ACI_GAP_ADDR_NOT_RESOLVED_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_ADDR_NOT_RESOLVED_VSEVT_CODE \n");
          break; /* ACI_GAP_ADDR_NOT_RESOLVED_VSEVT_CODE */
      
        case (ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE):
          APP_DBG_MSG(">>== ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE\n");
          break; /* ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE */    

        case (ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE):
          APP_DBG_MSG(">>== ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE\n");
          APP_DBG_MSG("     - numeric_value = %ld\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          APP_DBG_MSG("     - Hex_value = %lx\n",
                      ((aci_gap_numeric_comparison_value_event_rp0 *)(p_blecore_evt->data))->Numeric_Value);
          ret = aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, YES); /* CONFIRM_YES = 1 */
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno-->YES : Fail, reason: 0x%x\n", ret);
          } 
          else 
          {
            APP_DBG_MSG("==>> aci_gap_numeric_comparison_value_confirm_yesno-->YES : Success \n");
          }
          GapProcReq(GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM);
          break;

        case (ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE):
        {
          pairing_complete = (aci_gap_pairing_complete_event_rp0*)p_blecore_evt->data;

          APP_DBG_MSG("ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE, Connection_Handle=0x%04X Status=%d Reason=0x%02x \n",pairing_complete->Connection_Handle,pairing_complete->Status,pairing_complete->Reason);
          if (pairing_complete->Status == SMP_PAIRING_STATUS_SMP_TIMEOUT)
          {
            APP_DBG_MSG(" ** Pairing Timeout Status=%d Reason=0x%02x , \n! Please ignore this BLE Device on the iOS/Android Device Setting=>Bluetooth=>My Device or Paired Device ! \n",pairing_complete->Status,pairing_complete->Reason);
            APP_BLE_Remove_Bonding_Info();
          }
          else if (pairing_complete->Status == SMP_PAIRING_STATUS_PAIRING_FAILED)
          {
            APP_DBG_MSG(" ** Pairing KO Status=%d Reason=0x%02x , \n! Please ignore this BLE Device on the iOS/Android Device Setting=>Bluetooth=>My Device or Paired Device ! \n",pairing_complete->Status,pairing_complete->Reason);
            APP_BLE_Remove_Bonding_Info();
          }
          else if (pairing_complete->Status == SMP_PAIRING_STATUS_SUCCESS)
          {
            uint8_t Peer_Bonded,Security_Mode, Security_Level;
            Peer_Bonded = BleApplicationContext.Peer_Bonded;
            Security_Mode = BleApplicationContext.Security_Mode;
            Security_Level = BleApplicationContext.Security_Level;
        
            APP_BLE_Peer_Bonded_Check();
            APP_DBG_MSG("ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE  Peer_Bonded=%d => %d  Security_Mode=%d => %d Security_Level=%d => %d \n",
            Peer_Bonded,BleApplicationContext.Peer_Bonded,Security_Mode,BleApplicationContext.Security_Mode,Security_Level,BleApplicationContext.Security_Level);
     
          } /* SMP_PAIRING_STATUS_SUCCESS */

          if (BleApplicationContext.Security_Request == 0x01)
          {
            gap_cmd_resp_release(0);
          }
        }
          break; /* ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE */
        /* USER CODE END ecode */

        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
          APP_DBG_MSG(">>== ACI_GAP_PROC_COMPLETE_VSEVT_CODE \r");
          /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

          /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
          break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */

        case ACI_GATT_INDICATION_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GATT_INDICATION_VSEVT_CODE \r");
          aci_gatt_confirm_indication(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
        }
        break;

        /* USER CODE BEGIN BLUE_EVT */

        /* USER CODE END BLUE_EVT */
      }
      break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE BEGIN EVENT_PCKT */

      /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN ECODE_DEFAULT*/

      /* USER CODE END ECODE_DEFAULT*/
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Server_Connection_Status(void)
{
  return BleApplicationContext.Device_Connection_Status;
}

/* USER CODE BEGIN FD*/
void APP_BLE_Key_Button1_Action(void)
{
  ANCS_App_KeyButton1Action();
  APP_DBG_MSG("\n ** Term CONNECTION **  \n");
  aci_gap_terminate(BleApplicationContext.connection_handle, 0x13);
}

void APP_BLE_Key_Button2_Action(void)
{
  ANCS_App_KeyButton2Action();
}

void APP_BLE_Key_Button3_Action(void)
{
  ANCS_App_KeyButton3Action();
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  APP_DBG_MSG(" aci_gap_clear_security_db & aci_gap_remove_bonded_device & aci_gap_terminate \n");
  aci_gap_remove_bonded_device(BleApplicationContext.Peer_Address_Type,BleApplicationContext.Peer_Address);
  ret = aci_gap_clear_security_db();
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: %d \n", ret);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
  }
  aci_gap_terminate(BleApplicationContext.connection_handle, 0x13);
}

/* USER CODE END FD*/

