STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_HeartRate_ANCS/STM32_WPAN/App/app_ble.c
void APP_BLE_Remove_Bonding_Info(void)
{
  APP_DBG_MSG(" aci_gap_clear_security_db & aci_gap_remove_bonded_device \n");
  aci_gap_remove_bonded_device(BleApplicationContext.Peer_Address_Type,BleApplicationContext.Peer_Address);
  aci_gap_clear_security_db();
  return;
}

void APP_BLE_Peripheral_Security_Request(void)
{
  APP_BLE_Peer_Bonded_Check();
  
  if ((BleApplicationContext.Peer_Bonded == 0x00) ||
      ( (BleApplicationContext.Peer_Bonded == 0x01) && (BleApplicationContext.Security_Mode == 0x01) && (BleApplicationContext.Security_Level == 0x01) )
    )
  {
    GapProcReq(GAP_PROC_PERIPHERAL_SECURITY_REQ);
  }
  
  return;
}

static void GapProcReq(GapProcId_t GapProcId)
{
  tBleStatus status;

  switch(GapProcId)
  {
    case GAP_PROC_PERIPHERAL_SECURITY_REQ:
    {
      BleApplicationContext.Security_Request = 0x01;
      status = aci_gap_slave_security_req(BleApplicationContext.connection_handle); 
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("GAP_PROC_PERIPHERAL_SECURITY_REQ aci_gap_slave_security_req  status=0x%02x \n",status);
      }
     
      APP_DBG_MSG("waiting for  ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE \n");
      gap_cmd_resp_wait(GAP_DEFAULT_TIMEOUT);/* waiting for ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE */
      BleApplicationContext.Security_Request = 0x00;
      APP_DBG_MSG("waited for  ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE \n");
    }
      break;

    case GAP_PROC_PASS_KEY_RESPONSE:
    {
      APP_DBG_MSG("GAP_PROC_PASS_KEY_RESPONSE \n");
      aci_gap_pass_key_resp(BleApplicationContext.connection_handle, CFG_FIXED_PIN);/* response for ACI_GAP_PASS_KEY_REQ_VSEVT_CODE */
    }
      break;

    case GAP_PROC_ALLOW_REBOND:
    {
      APP_DBG_MSG("GAP_PROC_ALLOW_REBOND aci_gap_allow_rebond(0x%04X)\n",BleApplicationContext.connection_handle);
      aci_gap_allow_rebond(BleApplicationContext.connection_handle);/* response for ACI_GAP_BOND_LOST_VSEVT_CODE */
    }
      break;

    case GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM:
    {
      aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.connection_handle, 1); /* CONFIRM_YES = 1 */
      
      APP_DBG_MSG("GAP_PROC_NUMERIC_COMPARISON_VALUE_CONFIRM ** aci_gap_numeric_comparison_value_confirm_yesno-->YES \n");
    }
      break;
		  
    case GAP_PROC_TERMINATE_CONNECTION:
    {
      APP_DBG_MSG("terminate connection \n");
      status = aci_gap_terminate(BleApplicationContext.connection_handle,0x13);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("Term Connection cmd failure: 0x%x\n", status);
      }
      gap_cmd_resp_wait(GAP_DEFAULT_TIMEOUT);
      
      APP_DBG_MSG("GAP_PROC_TERMINATE_CONNECTION complete event received\n");
    }
      break;
	  
    default:
      break;
  }
  return;
}

static void gap_cmd_resp_release(uint32_t flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_GAP_PROC_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(uint32_t timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_GAP_PROC_COMPLETE);
  return;
}

/* USER CODE END FD_SPECIFIC_FUNCTIONS */
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void* p_Data)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);

  return;
}

void hci_cmd_resp_release(uint32_t Flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);

  return;
}

void hci_cmd_resp_wait(uint32_t Timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);

  return;
}

static void BLE_UserEvtRx(void *p_Payload)
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  tHCI_UserEvtRxParam *p_param;

  p_param = (tHCI_UserEvtRxParam *)p_Payload;

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(p_param->pckt->evtserial));
  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    p_param->status = HCI_TL_UserEventFlow_Enable;
  }
  else
  {
    p_param->status = HCI_TL_UserEventFlow_Disable;
  }

  return;
}

static void BLE_StatusNot(HCI_TL_CmdStatus_t Status)
{
  uint32_t task_id_list;
  switch (Status)
  {
    case HCI_TL_CmdBusy:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_PauseTask(task_id_list);
      /* USER CODE BEGIN HCI_TL_CmdBusy */

      /* USER CODE END HCI_TL_CmdBusy */
      break;

    case HCI_TL_CmdAvailable:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_ResumeTask(task_id_list);
      /* USER CODE BEGIN HCI_TL_CmdAvailable */

      /* USER CODE END HCI_TL_CmdAvailable */
      break;

    default:
      /* USER CODE BEGIN Status */

      /* USER CODE END Status */
      break;
  }

  return;
}

void SVCCTL_ResumeUserEventFlow(void)
{
  hci_resume_flow();

  return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
